# MicroinchesPerInchDegreeFahrenheit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
UnitTypeId..::..MicroinchesPerInchDegreeFahrenheit Property
UnitTypeId Class See Also
---
Microinches per inch degree Fahrenheit.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId MicroinchesPerInchDegreeFahrenheit { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property MicroinchesPerInchDegreeFahrenheit As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ MicroinchesPerInchDegreeFahrenheit {
	ForgeTypeId^ get ();
}
```

# See Also
UnitTypeId Class
Autodesk.Revit.DB Namespace